# Creating a database

In [1]:
import sqlite3

In [16]:
con = sqlite3.connect('mydatabase.db')

In [4]:
#cursor
curs = con.cursor()

In [6]:
#create table 
sql="""
create table employees(id integer PRIMARY KEY, name text, salary real, department text, position text, hireDate text)
"""

curs.execute(sql)

In [10]:
#insert data 

sql= """
INSERT INTO employees VALUES(2, 'Juan', 700, 'HR', 'Manager', '2017-03-04')
"""
curs.execute(sql)
con.commit()

In [11]:
#insertando informacion de otra forma con una funcion

def sql_insert(con, curs, entities):
 
    curs.execute('INSERT INTO employees(id, name, salary, department, position, hireDate) VALUES(?, ?, ?, ?, ?, ?)', entities)
    
    con.commit()
 
entities = (3, 'Andrew', 800, 'IT', 'Tech', '2018-02-06')
 
sql_insert(con=con, curs=curs, entities=entities)

In [12]:
#select from table 

import pandas as pd 

sql="""
select * from employees
"""

employees = pd.read_sql(sql, con)
employees

   id    name  salary department position    hireDate
0   1    John   700.0         HR  Manager  2017-01-04
1   2    Juan   700.0         HR  Manager  2017-03-04
2   3  Andrew   800.0         IT     Tech  2018-02-06

In [13]:
#listar las tablas

sql="""
SELECT name from sqlite_master where type= "table"
"""

tables = pd.read_sql(sql, con)
tables

        name
0  employees

# para extraer todas las rows con fetch all 
    cursorObj.execute('SELECT * FROM employees')
 
    rows = cursorObj.fetchall()
 
    for row in rows:
 
        print(row)

In [14]:
#ejemplo de update table 

sql="""
UPDATE employees SET name = "Rogers" where id = 2
"""
curs.execute(sql)

con.commit()

In [17]:
#see the updates 
sql="""
select * from employees
"""

employees = pd.read_sql(sql, con)
employees

   id    name  salary department position    hireDate
0   1    John   700.0         HR  Manager  2017-01-04
1   2  Rogers   700.0         HR  Manager  2017-03-04
2   3  Andrew   800.0         IT     Tech  2018-02-06